{
    "componentChunkName": "component---node-modules-gatsby-theme-primer-wiki-src-templates-post-query-js",
    "path": "/安全知识库/Blue Team能力建设/威胁检测规则/Elastic Rules/",
    "result": {"data":{"mdx":{"id":"1657a728-e7bb-5735-b3cc-9db151a3f056","tableOfContents":{"items":[{"url":"#1-介绍","title":"1. 介绍"},{"url":"#2-案例","title":"2. 案例"},{"url":"#3-参考资料","title":"3. 参考资料"}]},"fields":{"title":"Elastic Rules","slug":"/安全知识库/Blue Team能力建设/威胁检测规则/Elastic Rules/","url":"https://test.mars.run/安全知识库/Blue Team能力建设/威胁检测规则/Elastic Rules/","editUrl":"https://github.com/theowenyoung/foam-template-gatsby-theme-primer-wiki/tree/main/安全知识库/Blue Team能力建设/威胁检测规则/Elastic Rules.md","lastUpdatedAt":"2023-04-09T03:44:47.000Z","lastUpdated":"4/9/2023","gitCreatedAt":"2023-04-09T03:44:47.000Z","shouldShowTitle":true},"frontmatter":{"title":"Elastic Rules","description":null,"imageAlt":null,"tags":["Blue Team能力建设","威胁检测规则","Elastic"],"date":null,"dateModified":null,"language":null,"seoTitle":null,"image":null},"body":"var _excluded = [\"components\"];\n\nfunction _extends() { _extends = Object.assign || function (target) { for (var i = 1; i < arguments.length; i++) { var source = arguments[i]; for (var key in source) { if (Object.prototype.hasOwnProperty.call(source, key)) { target[key] = source[key]; } } } return target; }; return _extends.apply(this, arguments); }\n\nfunction _objectWithoutProperties(source, excluded) { if (source == null) return {}; var target = _objectWithoutPropertiesLoose(source, excluded); var key, i; if (Object.getOwnPropertySymbols) { var sourceSymbolKeys = Object.getOwnPropertySymbols(source); for (i = 0; i < sourceSymbolKeys.length; i++) { key = sourceSymbolKeys[i]; if (excluded.indexOf(key) >= 0) continue; if (!Object.prototype.propertyIsEnumerable.call(source, key)) continue; target[key] = source[key]; } } return target; }\n\nfunction _objectWithoutPropertiesLoose(source, excluded) { if (source == null) return {}; var target = {}; var sourceKeys = Object.keys(source); var key, i; for (i = 0; i < sourceKeys.length; i++) { key = sourceKeys[i]; if (excluded.indexOf(key) >= 0) continue; target[key] = source[key]; } return target; }\n\n/* @jsxRuntime classic */\n\n/* @jsx mdx */\nvar _frontmatter = {\n  \"title\": \"Elastic Rules\",\n  \"tags\": [\"Blue Team能力建设\", \"威胁检测规则\", \"Elastic\"]\n};\nvar layoutProps = {\n  _frontmatter: _frontmatter\n};\nvar MDXLayout = \"wrapper\";\nreturn function MDXContent(_ref) {\n  var components = _ref.components,\n      props = _objectWithoutProperties(_ref, _excluded);\n\n  return mdx(MDXLayout, _extends({}, layoutProps, props, {\n    components: components,\n    mdxType: \"MDXLayout\"\n  }), mdx(\"h1\", {\n    \"id\": \"1-介绍\"\n  }, \"1. \\u4ECB\\u7ECD\"), mdx(\"p\", null, \"\\u5185\\u7F6E100+\\u68C0\\u6D4B\\u89C4\\u5219\\u53EF\\u76F4\\u63A5\\u4F7F\\u7528\\uFF0C\\u5982\\u4E0B\\u56FE\\uFF1A\\n\", mdx(\"img\", {\n    parentName: \"p\",\n    \"src\": \"https://cdn.jsdelivr.net/gh/MarsAuthority/sec_pic@master/uPic/2023-01/nDBkDF.jpg\",\n    \"alt\": \"nDBkDF\"\n  })), mdx(\"h1\", {\n    \"id\": \"2-案例\"\n  }, \"2. \\u6848\\u4F8B\"), mdx(\"p\", null, \"\\u68C0\\u6D4B\\u8BA1\\u5212\\u4EFB\\u52A1\\uFF08scheduled task\\uFF09\\u662F\\u5426\\u88AB\\u521B\\u5EFA\"), mdx(\"ul\", null, mdx(\"li\", {\n    parentName: \"ul\"\n  }, mdx(\"strong\", {\n    parentName: \"li\"\n  }, \"Rule type\"), \"\\uFF1AEQL\"), mdx(\"li\", {\n    parentName: \"ul\"\n  }, mdx(\"strong\", {\n    parentName: \"li\"\n  }, \"Rule indices\"), \":\", mdx(\"ul\", {\n    parentName: \"li\"\n  }, mdx(\"li\", {\n    parentName: \"ul\"\n  }, \"winlogbeat-*\"), mdx(\"li\", {\n    parentName: \"ul\"\n  }, \"logs-system.*\"))), mdx(\"li\", {\n    parentName: \"ul\"\n  }, mdx(\"strong\", {\n    parentName: \"li\"\n  }, \"Severity\"), \"\\uFF1ALow\"), mdx(\"li\", {\n    parentName: \"ul\"\n  }, mdx(\"strong\", {\n    parentName: \"li\"\n  }, \"Risk score\"), \"\\uFF1A21\"), mdx(\"li\", {\n    parentName: \"ul\"\n  }, mdx(\"strong\", {\n    parentName: \"li\"\n  }, \"Runs every\"), \"\\uFF1A5 min\"), mdx(\"li\", {\n    parentName: \"ul\"\n  }, mdx(\"strong\", {\n    parentName: \"li\"\n  }, \"Searches indices from\"), \"\\uFF1Anow-9m\"), mdx(\"li\", {\n    parentName: \"ul\"\n  }, mdx(\"strong\", {\n    parentName: \"li\"\n  }, \"Maximum alerts per execution\"), \"\\uFF1A100\"), mdx(\"li\", {\n    parentName: \"ul\"\n  }, mdx(\"strong\", {\n    parentName: \"li\"\n  }, \"References\"), \"\\uFF1A\", mdx(\"a\", {\n    parentName: \"li\",\n    \"href\": \"https://docs.microsoft.com/en-us/windows/security/threat-protection/auditing/event-4698\"\n  }, \"https://docs.microsoft.com/en-us/windows/security/threat-protection/auditing/event-4698\")), mdx(\"li\", {\n    parentName: \"ul\"\n  }, mdx(\"strong\", {\n    parentName: \"li\"\n  }, \"Potential false positives\"), \"\\uFF1A\\u5B89\\u88C5\\u65B0\\u8F6F\\u4EF6\\u65F6\\uFF0C\\u4E5F\\u53EF\\u80FD\\u89E6\\u53D1\\u521B\\u5EFA\\u5408\\u6CD5\\u7684\\u8BA1\\u5212\\u4EFB\\u52A1\"), mdx(\"li\", {\n    parentName: \"ul\"\n  }, \"\\u89C4\\u5219\\uFF1A\")), mdx(\"pre\", null, mdx(\"code\", {\n    parentName: \"pre\"\n  }, \"iam where event.action == \\\"scheduled-task-created\\\" and /* excluding \\ntasks created by the computer account */ not user.name : \\\"*$\\\" and\\n/* TaskContent is not parsed, exclude by full taskname noisy ones */\\nnot winlog.event_data.TaskName : (\\\"\\\\\\\\OneDrive Standalone\\nUpdate Task-S-1-5-21*\\\", \\\"\\\\\\\\Hewlett-Packard\\\\\\\\HP Web\\nProducts Detection\\\", \\\"\\\\\\\\Hewlett-Packard\\\\\\\\HPDeviceCheck\\\")\\n\")), mdx(\"ul\", null, mdx(\"li\", {\n    parentName: \"ul\"\n  }, mdx(\"strong\", {\n    parentName: \"li\"\n  }, \"Framework\"), \": MITRE ATT&CKTM\", mdx(\"ul\", {\n    parentName: \"li\"\n  }, mdx(\"li\", {\n    parentName: \"ul\"\n  }, \"Tactic:\", mdx(\"ul\", {\n    parentName: \"li\"\n  }, mdx(\"li\", {\n    parentName: \"ul\"\n  }, \"Name: Persistence\"), mdx(\"li\", {\n    parentName: \"ul\"\n  }, \"ID: TA0003\"), mdx(\"li\", {\n    parentName: \"ul\"\n  }, \"Reference URL: \", mdx(\"a\", {\n    parentName: \"li\",\n    \"href\": \"https://attack.mitre.org/tactics/TA0003/\"\n  }, \"https://attack.mitre.org/tactics/TA0003/\")))), mdx(\"li\", {\n    parentName: \"ul\"\n  }, \"Technique:\", mdx(\"ul\", {\n    parentName: \"li\"\n  }, mdx(\"li\", {\n    parentName: \"ul\"\n  }, \"Name: Scheduled Task/Job\"), mdx(\"li\", {\n    parentName: \"ul\"\n  }, \"ID: T1053\"), mdx(\"li\", {\n    parentName: \"ul\"\n  }, \"Reference URL: \", mdx(\"a\", {\n    parentName: \"li\",\n    \"href\": \"https://attack.mitre.org/techniques/T1053/\"\n  }, \"https://attack.mitre.org/techniques/T1053/\"))))))), mdx(\"h1\", {\n    \"id\": \"3-参考资料\"\n  }, \"3. \\u53C2\\u8003\\u8D44\\u6599\"), mdx(\"ul\", null, mdx(\"li\", {\n    parentName: \"ul\"\n  }, mdx(\"a\", {\n    parentName: \"li\",\n    \"href\": \"https://www.elastic.co/guide/en/security/current/prebuilt-rules.html\"\n  }, \"https://www.elastic.co/guide/en/security/current/prebuilt-rules.html\"))));\n}\n;\nMDXContent.isMDXComponent = true;","rawBody":"---\r\ntitle: Elastic Rules\r\ntags:\r\n- Blue Team能力建设\r\n- 威胁检测规则\r\n- Elastic\r\n---\r\n\r\n# 1. 介绍\r\n内置100+检测规则可直接使用，如下图：\r\n![nDBkDF](https://cdn.jsdelivr.net/gh/MarsAuthority/sec_pic@master/uPic/2023-01/nDBkDF.jpg)\r\n\r\n\r\n# 2. 案例\r\n检测计划任务（scheduled task）是否被创建\r\n\r\n- **Rule type**：EQL\r\n- **Rule indices**:\r\n  - winlogbeat-*\r\n  - logs-system.*\r\n- **Severity**：Low\r\n- **Risk score**：21\r\n- **Runs every**：5 min\r\n- **Searches indices from**：now-9m\r\n- **Maximum alerts per execution**：100\r\n- **References**：https://docs.microsoft.com/en-us/windows/security/threat-protection/auditing/event-4698\r\n- **Potential false positives**：安装新软件时，也可能触发创建合法的计划任务\r\n- 规则：\r\n\r\n```\r\niam where event.action == \"scheduled-task-created\" and /* excluding \r\ntasks created by the computer account */ not user.name : \"*$\" and\r\n/* TaskContent is not parsed, exclude by full taskname noisy ones */\r\nnot winlog.event_data.TaskName : (\"\\\\OneDrive Standalone\r\nUpdate Task-S-1-5-21*\", \"\\\\Hewlett-Packard\\\\HP Web\r\nProducts Detection\", \"\\\\Hewlett-Packard\\\\HPDeviceCheck\")\r\n```\r\n\r\n- **Framework**: MITRE ATT&CKTM\r\n  - Tactic:\r\n    - Name: Persistence\r\n    - ID: TA0003\r\n    - Reference URL: [https://attack.mitre.org/tactics/TA0003/](https://attack.mitre.org/tactics/TA0003/)\r\n  - Technique:\r\n    - Name: Scheduled Task/Job\r\n    - ID: T1053\r\n    - Reference URL: [https://attack.mitre.org/techniques/T1053/](https://attack.mitre.org/techniques/T1053/)\r\n\r\n# 3. 参考资料\r\n- [https://www.elastic.co/guide/en/security/current/prebuilt-rules.html](https://www.elastic.co/guide/en/security/current/prebuilt-rules.html)","excerpt":"1. 介绍 内置100+检测规则可直接使用，如下图：\n 2. 案例 检测计划任务（scheduled task）是否被创建 Rule type ：EQL Rule indices : winlogbeat-* logs-system.* Severity ：Low Risk s…","outboundReferences":[],"inboundReferences":[]},"tagsOutbound":{"nodes":[{"frontmatter":{"title":"DNS Tunnel隧道检测","tags":["Blue Team能力建设","命令与控制 C2","DNS"]},"fields":{"slug":"/安全知识库/Blue Team能力建设/命令与控制 C2/DNS Tunnel隧道检测/","title":"DNS Tunnel隧道检测","lastUpdated":"4/9/2023","lastUpdatedAt":"2023-04-09T03:44:47.000Z","gitCreatedAt":"2023-04-09T03:44:47.000Z"}},{"frontmatter":{"title":"基于统计学的C2流量检测","tags":["Blue Team能力建设","命令与控制 C2","流量检测"]},"fields":{"slug":"/安全知识库/Blue Team能力建设/命令与控制 C2/基于统计学的C2流量检测/","title":"基于统计学的C2流量检测","lastUpdated":"4/9/2023","lastUpdatedAt":"2023-04-09T03:44:47.000Z","gitCreatedAt":"2023-04-09T03:44:47.000Z"}},{"frontmatter":{"title":"Elastic Rules","tags":["Blue Team能力建设","威胁检测规则","Elastic"]},"fields":{"slug":"/安全知识库/Blue Team能力建设/威胁检测规则/Elastic Rules/","title":"Elastic Rules","lastUpdated":"4/9/2023","lastUpdatedAt":"2023-04-09T03:44:47.000Z","gitCreatedAt":"2023-04-09T03:44:47.000Z"}},{"frontmatter":{"title":"SIGMA Rules","tags":["Blue Team能力建设","威胁检测规则","SIGMA"]},"fields":{"slug":"/安全知识库/Blue Team能力建设/威胁检测规则/SIGMA Rules/","title":"SIGMA Rules","lastUpdated":"4/9/2023","lastUpdatedAt":"2023-04-09T03:44:47.000Z","gitCreatedAt":"2023-04-09T03:44:47.000Z"}},{"frontmatter":{"title":"Splunk Rules","tags":["Blue Team能力建设","威胁检测规则","Splunk"]},"fields":{"slug":"/安全知识库/Blue Team能力建设/威胁检测规则/Splunk Rules/","title":"Splunk Rules","lastUpdated":"4/9/2023","lastUpdatedAt":"2023-04-09T03:44:47.000Z","gitCreatedAt":"2023-04-09T03:44:47.000Z"}}]}},"pageContext":{"tags":["Blue Team能力建设","威胁检测规则","Elastic"],"slug":"/安全知识库/Blue Team能力建设/威胁检测规则/Elastic Rules/","sidebarItems":[{"title":"","items":[{"title":"Recently Updated","url":"/latest/","collapse":true,"indent":false,"items":[{"title":"04-09: Security.News@202205","url":"/安全通讯 Security.News/Security.News@202205/"},{"title":"04-09: 阅读学习工作流","url":"/知识管理/阅读学习工作流/"},{"title":"04-09: 关于这个站点","url":"/"},{"title":"04-09: DNS Tunnel隧道检测","url":"/安全知识库/Blue Team能力建设/命令与控制 C2/DNS Tunnel隧道检测/"},{"title":"04-09: 基于统计学的C2流量检测","url":"/安全知识库/Blue Team能力建设/命令与控制 C2/基于统计学的C2流量检测/"},{"title":"04-09: Elastic Rules","url":"/安全知识库/Blue Team能力建设/威胁检测规则/Elastic Rules/"},{"title":"04-09: SIGMA Rules","url":"/安全知识库/Blue Team能力建设/威胁检测规则/SIGMA Rules/"},{"title":"04-09: Splunk Rules","url":"/安全知识库/Blue Team能力建设/威胁检测规则/Splunk Rules/"},{"title":"04-09: WAF能力评估&测试","url":"/安全知识库/Blue Team基础设施/Web应用防火墙/WAF能力评估&测试/"},{"title":"04-09: WAF能力评估&测试","url":"/安全知识库/Blue Team基础设施/Web应用防火墙/通过机器学习改善 WAF/"}]}]},{"title":"Categories","items":[{"title":"关于这个站点","url":"/","items":[]},{"title":"安全知识库","url":"","items":[{"title":"Blue Team基础设施","url":"","items":[{"title":"Web应用防火墙","url":"","items":[{"title":"WAF能力评估&测试","url":"/安全知识库/Blue Team基础设施/Web应用防火墙/WAF能力评估&测试/","items":[]},{"title":"WAF能力评估&测试","url":"/安全知识库/Blue Team基础设施/Web应用防火墙/通过机器学习改善 WAF/","items":[]}]},{"title":"系统设计","url":"","items":[{"title":"系统设计基础知识","url":"/安全知识库/Blue Team基础设施/系统设计/系统设计基础知识/","items":[]}]},{"title":"终端基础设施","url":"","items":[{"title":"EDR","url":"","items":[{"title":"2021 EPP魔力象限 EPP Magic Quadrant","url":"/安全知识库/Blue Team基础设施/终端基础设施/EDR/2021 EPP魔力象限 EPP Magic Quadrant/","items":[]},{"title":"保障IDC安全：分布式HIDS集群架构设计","url":"/安全知识库/Blue Team基础设施/终端基础设施/EDR/保障IDC安全：分布式HIDS集群架构设计/","items":[]}]},{"title":"EDR商业化产品","url":"","items":[{"title":"CrowdStrike Falcon","url":"/安全知识库/Blue Team基础设施/终端基础设施/EDR商业化产品/CrowdStrike Falcon/","items":[]}]},{"title":"EDR能力评估","url":"","items":[{"title":"MITRE EDR技术能力评估","url":"/安全知识库/Blue Team基础设施/终端基础设施/EDR能力评估/MITRE EDR技术能力评估/","items":[]},{"title":"Red Canary EDR买家指南","url":"/安全知识库/Blue Team基础设施/终端基础设施/EDR能力评估/Red Canary EDR买家指南/","items":[]}]}]},{"title":"网络基础设施","url":"","items":[{"title":"加密流量解决方案","url":"/安全知识库/Blue Team基础设施/网络基础设施/加密流量解决方案/","items":[]},{"title":"网络流量采集方案","url":"/安全知识库/Blue Team基础设施/网络基础设施/网络流量采集方案/","items":[]}]}]},{"title":"Blue Team能力建设","url":"","items":[{"title":"命令与控制 C2","url":"","items":[{"title":"DNS Tunnel隧道检测","url":"/安全知识库/Blue Team能力建设/命令与控制 C2/DNS Tunnel隧道检测/","items":[]},{"title":"基于统计学的C2流量检测","url":"/安全知识库/Blue Team能力建设/命令与控制 C2/基于统计学的C2流量检测/","items":[]}]},{"title":"威胁检测规则","url":"","items":[{"title":"Elastic Rules","url":"/安全知识库/Blue Team能力建设/威胁检测规则/Elastic Rules/","items":[]},{"title":"SIGMA Rules","url":"/安全知识库/Blue Team能力建设/威胁检测规则/SIGMA Rules/","items":[]},{"title":"Splunk Rules","url":"/安全知识库/Blue Team能力建设/威胁检测规则/Splunk Rules/","items":[]}]}]}]},{"title":"安全通讯 Security.News","url":"","items":[{"title":"Security.News@202205","url":"/安全通讯 Security.News/Security.News@202205/","items":[]}]},{"title":"知识管理","url":"","items":[{"title":"阅读学习工作流","url":"/知识管理/阅读学习工作流/","items":[]}]}]},{"title":"Tags","items":[{"title":"Blue Team基础设施","type":"tag","url":"/tags/blue-team基础设施/","items":[{"title":"WAF能力评估&测试","url":"/安全知识库/Blue Team基础设施/Web应用防火墙/WAF能力评估&测试/"},{"title":"WAF能力评估&测试","url":"/安全知识库/Blue Team基础设施/Web应用防火墙/通过机器学习改善 WAF/"},{"title":"系统设计基础知识","url":"/安全知识库/Blue Team基础设施/系统设计/系统设计基础知识/"},{"title":"加密流量解决方案","url":"/安全知识库/Blue Team基础设施/网络基础设施/加密流量解决方案/"},{"title":"网络流量采集方案","url":"/安全知识库/Blue Team基础设施/网络基础设施/网络流量采集方案/"},{"title":"2021 EPP魔力象限 EPP Magic Quadrant","url":"/安全知识库/Blue Team基础设施/终端基础设施/EDR/2021 EPP魔力象限 EPP Magic Quadrant/"},{"title":"保障IDC安全：分布式HIDS集群架构设计","url":"/安全知识库/Blue Team基础设施/终端基础设施/EDR/保障IDC安全：分布式HIDS集群架构设计/"},{"title":"MITRE EDR技术能力评估","url":"/安全知识库/Blue Team基础设施/终端基础设施/EDR能力评估/MITRE EDR技术能力评估/"},{"title":"Red Canary EDR买家指南","url":"/安全知识库/Blue Team基础设施/终端基础设施/EDR能力评估/Red Canary EDR买家指南/"},{"title":"CrowdStrike Falcon","url":"/安全知识库/Blue Team基础设施/终端基础设施/EDR商业化产品/CrowdStrike Falcon/"}]},{"title":"Blue Team能力建设","type":"tag","url":"/tags/blue-team能力建设/","items":[{"title":"DNS Tunnel隧道检测","url":"/安全知识库/Blue Team能力建设/命令与控制 C2/DNS Tunnel隧道检测/"},{"title":"基于统计学的C2流量检测","url":"/安全知识库/Blue Team能力建设/命令与控制 C2/基于统计学的C2流量检测/"},{"title":"Elastic Rules","url":"/安全知识库/Blue Team能力建设/威胁检测规则/Elastic Rules/"},{"title":"SIGMA Rules","url":"/安全知识库/Blue Team能力建设/威胁检测规则/SIGMA Rules/"},{"title":"Splunk Rules","url":"/安全知识库/Blue Team能力建设/威胁检测规则/Splunk Rules/"}]},{"title":"Cloudflare","type":"tag","url":"/tags/cloudflare/","items":[{"title":"WAF能力评估&测试","url":"/安全知识库/Blue Team基础设施/Web应用防火墙/通过机器学习改善 WAF/"}]},{"title":"CrowdStrike","type":"tag","url":"/tags/crowd-strike/","items":[{"title":"CrowdStrike Falcon","url":"/安全知识库/Blue Team基础设施/终端基础设施/EDR商业化产品/CrowdStrike Falcon/"}]},{"title":"DNS","type":"tag","url":"/tags/dns/","items":[{"title":"DNS Tunnel隧道检测","url":"/安全知识库/Blue Team能力建设/命令与控制 C2/DNS Tunnel隧道检测/"}]},{"title":"EDR","type":"tag","url":"/tags/edr/","items":[{"title":"2021 EPP魔力象限 EPP Magic Quadrant","url":"/安全知识库/Blue Team基础设施/终端基础设施/EDR/2021 EPP魔力象限 EPP Magic Quadrant/"},{"title":"保障IDC安全：分布式HIDS集群架构设计","url":"/安全知识库/Blue Team基础设施/终端基础设施/EDR/保障IDC安全：分布式HIDS集群架构设计/"}]},{"title":"EDR商业化产品","type":"tag","url":"/tags/edr商业化产品/","items":[{"title":"CrowdStrike Falcon","url":"/安全知识库/Blue Team基础设施/终端基础设施/EDR商业化产品/CrowdStrike Falcon/"}]},{"title":"EDR能力评估","type":"tag","url":"/tags/edr能力评估/","items":[{"title":"MITRE EDR技术能力评估","url":"/安全知识库/Blue Team基础设施/终端基础设施/EDR能力评估/MITRE EDR技术能力评估/"},{"title":"Red Canary EDR买家指南","url":"/安全知识库/Blue Team基础设施/终端基础设施/EDR能力评估/Red Canary EDR买家指南/"}]},{"title":"Elastic","type":"tag","url":"/tags/elastic/","items":[{"title":"Elastic Rules","url":"/安全知识库/Blue Team能力建设/威胁检测规则/Elastic Rules/"}]},{"title":"Extrahop","type":"tag","url":"/tags/extrahop/","items":[{"title":"加密流量解决方案","url":"/安全知识库/Blue Team基础设施/网络基础设施/加密流量解决方案/"}]},{"title":"Gigamon","type":"tag","url":"/tags/gigamon/","items":[{"title":"加密流量解决方案","url":"/安全知识库/Blue Team基础设施/网络基础设施/加密流量解决方案/"},{"title":"网络流量采集方案","url":"/安全知识库/Blue Team基础设施/网络基础设施/网络流量采集方案/"}]},{"title":"Google","type":"tag","url":"/tags/google/","items":[{"title":"Security.News@202205","url":"/安全通讯 Security.News/Security.News@202205/"},{"title":"加密流量解决方案","url":"/安全知识库/Blue Team基础设施/网络基础设施/加密流量解决方案/"}]},{"title":"MITRE","type":"tag","url":"/tags/mitre/","items":[{"title":"MITRE EDR技术能力评估","url":"/安全知识库/Blue Team基础设施/终端基础设施/EDR能力评估/MITRE EDR技术能力评估/"}]},{"title":"NSA","type":"tag","url":"/tags/nsa/","items":[{"title":"Security.News@202205","url":"/安全通讯 Security.News/Security.News@202205/"}]},{"title":"Palo Alto Networks","type":"tag","url":"/tags/palo-alto-networks/","items":[{"title":"加密流量解决方案","url":"/安全知识库/Blue Team基础设施/网络基础设施/加密流量解决方案/"}]},{"title":"Red Canary","type":"tag","url":"/tags/red-canary/","items":[{"title":"Red Canary EDR买家指南","url":"/安全知识库/Blue Team基础设施/终端基础设施/EDR能力评估/Red Canary EDR买家指南/"}]},{"title":"SIGMA","type":"tag","url":"/tags/sigma/","items":[{"title":"SIGMA Rules","url":"/安全知识库/Blue Team能力建设/威胁检测规则/SIGMA Rules/"}]},{"title":"SOAR","type":"tag","url":"/tags/soar/","items":[{"title":"Security.News@202205","url":"/安全通讯 Security.News/Security.News@202205/"}]},{"title":"Splunk","type":"tag","url":"/tags/splunk/","items":[{"title":"Splunk Rules","url":"/安全知识库/Blue Team能力建设/威胁检测规则/Splunk Rules/"}]},{"title":"Twitter","type":"tag","url":"/tags/twitter/","items":[{"title":"Security.News@202205","url":"/安全通讯 Security.News/Security.News@202205/"}]},{"title":"Web应用防火墙","type":"tag","url":"/tags/web应用防火墙/","items":[{"title":"WAF能力评估&测试","url":"/安全知识库/Blue Team基础设施/Web应用防火墙/WAF能力评估&测试/"},{"title":"WAF能力评估&测试","url":"/安全知识库/Blue Team基础设施/Web应用防火墙/通过机器学习改善 WAF/"}]},{"title":"供应链安全","type":"tag","url":"/tags/供应链安全/","items":[{"title":"Security.News@202205","url":"/安全通讯 Security.News/Security.News@202205/"}]},{"title":"加密流量","type":"tag","url":"/tags/加密流量/","items":[{"title":"加密流量解决方案","url":"/安全知识库/Blue Team基础设施/网络基础设施/加密流量解决方案/"}]},{"title":"命令与控制 C2","type":"tag","url":"/tags/命令与控制-c-2/","items":[{"title":"DNS Tunnel隧道检测","url":"/安全知识库/Blue Team能力建设/命令与控制 C2/DNS Tunnel隧道检测/"},{"title":"基于统计学的C2流量检测","url":"/安全知识库/Blue Team能力建设/命令与控制 C2/基于统计学的C2流量检测/"}]},{"title":"威胁检测规则","type":"tag","url":"/tags/威胁检测规则/","items":[{"title":"Elastic Rules","url":"/安全知识库/Blue Team能力建设/威胁检测规则/Elastic Rules/"},{"title":"SIGMA Rules","url":"/安全知识库/Blue Team能力建设/威胁检测规则/SIGMA Rules/"},{"title":"Splunk Rules","url":"/安全知识库/Blue Team能力建设/威胁检测规则/Splunk Rules/"}]},{"title":"学习资源","type":"tag","url":"/tags/学习资源/","items":[{"title":"Security.News@202205","url":"/安全通讯 Security.News/Security.News@202205/"}]},{"title":"安全事件","type":"tag","url":"/tags/安全事件/","items":[{"title":"Security.News@202205","url":"/安全通讯 Security.News/Security.News@202205/"}]},{"title":"安全架构","type":"tag","url":"/tags/安全架构/","items":[{"title":"系统设计基础知识","url":"/安全知识库/Blue Team基础设施/系统设计/系统设计基础知识/"}]},{"title":"数据泄露","type":"tag","url":"/tags/数据泄露/","items":[{"title":"Security.News@202205","url":"/安全通讯 Security.News/Security.News@202205/"}]},{"title":"最佳实践","type":"tag","url":"/tags/最佳实践/","items":[{"title":"Security.News@202205","url":"/安全通讯 Security.News/Security.News@202205/"}]},{"title":"机器学习","type":"tag","url":"/tags/机器学习/","items":[{"title":"WAF能力评估&测试","url":"/安全知识库/Blue Team基础设施/Web应用防火墙/通过机器学习改善 WAF/"}]},{"title":"流量检测","type":"tag","url":"/tags/流量检测/","items":[{"title":"基于统计学的C2流量检测","url":"/安全知识库/Blue Team能力建设/命令与控制 C2/基于统计学的C2流量检测/"}]},{"title":"知识管理","type":"tag","url":"/tags/知识管理/","items":[{"title":"阅读学习工作流","url":"/知识管理/阅读学习工作流/"}]},{"title":"系统设计","type":"tag","url":"/tags/系统设计/","items":[{"title":"系统设计基础知识","url":"/安全知识库/Blue Team基础设施/系统设计/系统设计基础知识/"}]},{"title":"终端基础设施","type":"tag","url":"/tags/终端基础设施/","items":[{"title":"2021 EPP魔力象限 EPP Magic Quadrant","url":"/安全知识库/Blue Team基础设施/终端基础设施/EDR/2021 EPP魔力象限 EPP Magic Quadrant/"},{"title":"保障IDC安全：分布式HIDS集群架构设计","url":"/安全知识库/Blue Team基础设施/终端基础设施/EDR/保障IDC安全：分布式HIDS集群架构设计/"},{"title":"MITRE EDR技术能力评估","url":"/安全知识库/Blue Team基础设施/终端基础设施/EDR能力评估/MITRE EDR技术能力评估/"},{"title":"Red Canary EDR买家指南","url":"/安全知识库/Blue Team基础设施/终端基础设施/EDR能力评估/Red Canary EDR买家指南/"},{"title":"CrowdStrike Falcon","url":"/安全知识库/Blue Team基础设施/终端基础设施/EDR商业化产品/CrowdStrike Falcon/"}]},{"title":"网络基础设施","type":"tag","url":"/tags/网络基础设施/","items":[{"title":"加密流量解决方案","url":"/安全知识库/Blue Team基础设施/网络基础设施/加密流量解决方案/"},{"title":"网络流量采集方案","url":"/安全知识库/Blue Team基础设施/网络基础设施/网络流量采集方案/"}]},{"title":"能力评估","type":"tag","url":"/tags/能力评估/","items":[{"title":"WAF能力评估&测试","url":"/安全知识库/Blue Team基础设施/Web应用防火墙/WAF能力评估&测试/"},{"title":"MITRE EDR技术能力评估","url":"/安全知识库/Blue Team基础设施/终端基础设施/EDR能力评估/MITRE EDR技术能力评估/"}]},{"title":"蜜罐","type":"tag","url":"/tags/蜜罐/","items":[{"title":"Security.News@202205","url":"/安全通讯 Security.News/Security.News@202205/"}]},{"title":"行业动态","type":"tag","url":"/tags/行业动态/","items":[{"title":"Security.News@202205","url":"/安全通讯 Security.News/Security.News@202205/"}]},{"title":"行业实践","type":"tag","url":"/tags/行业实践/","items":[{"title":"加密流量解决方案","url":"/安全知识库/Blue Team基础设施/网络基础设施/加密流量解决方案/"},{"title":"网络流量采集方案","url":"/安全知识库/Blue Team基础设施/网络基础设施/网络流量采集方案/"}]},{"title":"行业报告","type":"tag","url":"/tags/行业报告/","items":[{"title":"Security.News@202205","url":"/安全通讯 Security.News/Security.News@202205/"}]},{"title":"钓鱼","type":"tag","url":"/tags/钓鱼/","items":[{"title":"Security.News@202205","url":"/安全通讯 Security.News/Security.News@202205/"}]},{"title":"阿里云","type":"tag","url":"/tags/阿里云/","items":[{"title":"Security.News@202205","url":"/安全通讯 Security.News/Security.News@202205/"}]},{"title":"雾帜智能","type":"tag","url":"/tags/雾帜智能/","items":[{"title":"Security.News@202205","url":"/安全通讯 Security.News/Security.News@202205/"}]}]}],"tagsGroups":[{"title":"Blue Team基础设施","type":"tag","url":"/tags/blue-team基础设施/","items":[{"title":"WAF能力评估&测试","url":"/安全知识库/Blue Team基础设施/Web应用防火墙/WAF能力评估&测试/"},{"title":"WAF能力评估&测试","url":"/安全知识库/Blue Team基础设施/Web应用防火墙/通过机器学习改善 WAF/"},{"title":"系统设计基础知识","url":"/安全知识库/Blue Team基础设施/系统设计/系统设计基础知识/"},{"title":"加密流量解决方案","url":"/安全知识库/Blue Team基础设施/网络基础设施/加密流量解决方案/"},{"title":"网络流量采集方案","url":"/安全知识库/Blue Team基础设施/网络基础设施/网络流量采集方案/"},{"title":"2021 EPP魔力象限 EPP Magic Quadrant","url":"/安全知识库/Blue Team基础设施/终端基础设施/EDR/2021 EPP魔力象限 EPP Magic Quadrant/"},{"title":"保障IDC安全：分布式HIDS集群架构设计","url":"/安全知识库/Blue Team基础设施/终端基础设施/EDR/保障IDC安全：分布式HIDS集群架构设计/"},{"title":"MITRE EDR技术能力评估","url":"/安全知识库/Blue Team基础设施/终端基础设施/EDR能力评估/MITRE EDR技术能力评估/"},{"title":"Red Canary EDR买家指南","url":"/安全知识库/Blue Team基础设施/终端基础设施/EDR能力评估/Red Canary EDR买家指南/"},{"title":"CrowdStrike Falcon","url":"/安全知识库/Blue Team基础设施/终端基础设施/EDR商业化产品/CrowdStrike Falcon/"}]},{"title":"Blue Team能力建设","type":"tag","url":"/tags/blue-team能力建设/","items":[{"title":"DNS Tunnel隧道检测","url":"/安全知识库/Blue Team能力建设/命令与控制 C2/DNS Tunnel隧道检测/"},{"title":"基于统计学的C2流量检测","url":"/安全知识库/Blue Team能力建设/命令与控制 C2/基于统计学的C2流量检测/"},{"title":"Elastic Rules","url":"/安全知识库/Blue Team能力建设/威胁检测规则/Elastic Rules/"},{"title":"SIGMA Rules","url":"/安全知识库/Blue Team能力建设/威胁检测规则/SIGMA Rules/"},{"title":"Splunk Rules","url":"/安全知识库/Blue Team能力建设/威胁检测规则/Splunk Rules/"}]},{"title":"Cloudflare","type":"tag","url":"/tags/cloudflare/","items":[{"title":"WAF能力评估&测试","url":"/安全知识库/Blue Team基础设施/Web应用防火墙/通过机器学习改善 WAF/"}]},{"title":"CrowdStrike","type":"tag","url":"/tags/crowd-strike/","items":[{"title":"CrowdStrike Falcon","url":"/安全知识库/Blue Team基础设施/终端基础设施/EDR商业化产品/CrowdStrike Falcon/"}]},{"title":"DNS","type":"tag","url":"/tags/dns/","items":[{"title":"DNS Tunnel隧道检测","url":"/安全知识库/Blue Team能力建设/命令与控制 C2/DNS Tunnel隧道检测/"}]},{"title":"EDR","type":"tag","url":"/tags/edr/","items":[{"title":"2021 EPP魔力象限 EPP Magic Quadrant","url":"/安全知识库/Blue Team基础设施/终端基础设施/EDR/2021 EPP魔力象限 EPP Magic Quadrant/"},{"title":"保障IDC安全：分布式HIDS集群架构设计","url":"/安全知识库/Blue Team基础设施/终端基础设施/EDR/保障IDC安全：分布式HIDS集群架构设计/"}]},{"title":"EDR商业化产品","type":"tag","url":"/tags/edr商业化产品/","items":[{"title":"CrowdStrike Falcon","url":"/安全知识库/Blue Team基础设施/终端基础设施/EDR商业化产品/CrowdStrike Falcon/"}]},{"title":"EDR能力评估","type":"tag","url":"/tags/edr能力评估/","items":[{"title":"MITRE EDR技术能力评估","url":"/安全知识库/Blue Team基础设施/终端基础设施/EDR能力评估/MITRE EDR技术能力评估/"},{"title":"Red Canary EDR买家指南","url":"/安全知识库/Blue Team基础设施/终端基础设施/EDR能力评估/Red Canary EDR买家指南/"}]},{"title":"Elastic","type":"tag","url":"/tags/elastic/","items":[{"title":"Elastic Rules","url":"/安全知识库/Blue Team能力建设/威胁检测规则/Elastic Rules/"}]},{"title":"Extrahop","type":"tag","url":"/tags/extrahop/","items":[{"title":"加密流量解决方案","url":"/安全知识库/Blue Team基础设施/网络基础设施/加密流量解决方案/"}]},{"title":"Gigamon","type":"tag","url":"/tags/gigamon/","items":[{"title":"加密流量解决方案","url":"/安全知识库/Blue Team基础设施/网络基础设施/加密流量解决方案/"},{"title":"网络流量采集方案","url":"/安全知识库/Blue Team基础设施/网络基础设施/网络流量采集方案/"}]},{"title":"Google","type":"tag","url":"/tags/google/","items":[{"title":"Security.News@202205","url":"/安全通讯 Security.News/Security.News@202205/"},{"title":"加密流量解决方案","url":"/安全知识库/Blue Team基础设施/网络基础设施/加密流量解决方案/"}]},{"title":"MITRE","type":"tag","url":"/tags/mitre/","items":[{"title":"MITRE EDR技术能力评估","url":"/安全知识库/Blue Team基础设施/终端基础设施/EDR能力评估/MITRE EDR技术能力评估/"}]},{"title":"NSA","type":"tag","url":"/tags/nsa/","items":[{"title":"Security.News@202205","url":"/安全通讯 Security.News/Security.News@202205/"}]},{"title":"Palo Alto Networks","type":"tag","url":"/tags/palo-alto-networks/","items":[{"title":"加密流量解决方案","url":"/安全知识库/Blue Team基础设施/网络基础设施/加密流量解决方案/"}]},{"title":"Red Canary","type":"tag","url":"/tags/red-canary/","items":[{"title":"Red Canary EDR买家指南","url":"/安全知识库/Blue Team基础设施/终端基础设施/EDR能力评估/Red Canary EDR买家指南/"}]},{"title":"SIGMA","type":"tag","url":"/tags/sigma/","items":[{"title":"SIGMA Rules","url":"/安全知识库/Blue Team能力建设/威胁检测规则/SIGMA Rules/"}]},{"title":"SOAR","type":"tag","url":"/tags/soar/","items":[{"title":"Security.News@202205","url":"/安全通讯 Security.News/Security.News@202205/"}]},{"title":"Splunk","type":"tag","url":"/tags/splunk/","items":[{"title":"Splunk Rules","url":"/安全知识库/Blue Team能力建设/威胁检测规则/Splunk Rules/"}]},{"title":"Twitter","type":"tag","url":"/tags/twitter/","items":[{"title":"Security.News@202205","url":"/安全通讯 Security.News/Security.News@202205/"}]},{"title":"Web应用防火墙","type":"tag","url":"/tags/web应用防火墙/","items":[{"title":"WAF能力评估&测试","url":"/安全知识库/Blue Team基础设施/Web应用防火墙/WAF能力评估&测试/"},{"title":"WAF能力评估&测试","url":"/安全知识库/Blue Team基础设施/Web应用防火墙/通过机器学习改善 WAF/"}]},{"title":"供应链安全","type":"tag","url":"/tags/供应链安全/","items":[{"title":"Security.News@202205","url":"/安全通讯 Security.News/Security.News@202205/"}]},{"title":"加密流量","type":"tag","url":"/tags/加密流量/","items":[{"title":"加密流量解决方案","url":"/安全知识库/Blue Team基础设施/网络基础设施/加密流量解决方案/"}]},{"title":"命令与控制 C2","type":"tag","url":"/tags/命令与控制-c-2/","items":[{"title":"DNS Tunnel隧道检测","url":"/安全知识库/Blue Team能力建设/命令与控制 C2/DNS Tunnel隧道检测/"},{"title":"基于统计学的C2流量检测","url":"/安全知识库/Blue Team能力建设/命令与控制 C2/基于统计学的C2流量检测/"}]},{"title":"威胁检测规则","type":"tag","url":"/tags/威胁检测规则/","items":[{"title":"Elastic Rules","url":"/安全知识库/Blue Team能力建设/威胁检测规则/Elastic Rules/"},{"title":"SIGMA Rules","url":"/安全知识库/Blue Team能力建设/威胁检测规则/SIGMA Rules/"},{"title":"Splunk Rules","url":"/安全知识库/Blue Team能力建设/威胁检测规则/Splunk Rules/"}]},{"title":"学习资源","type":"tag","url":"/tags/学习资源/","items":[{"title":"Security.News@202205","url":"/安全通讯 Security.News/Security.News@202205/"}]},{"title":"安全事件","type":"tag","url":"/tags/安全事件/","items":[{"title":"Security.News@202205","url":"/安全通讯 Security.News/Security.News@202205/"}]},{"title":"安全架构","type":"tag","url":"/tags/安全架构/","items":[{"title":"系统设计基础知识","url":"/安全知识库/Blue Team基础设施/系统设计/系统设计基础知识/"}]},{"title":"数据泄露","type":"tag","url":"/tags/数据泄露/","items":[{"title":"Security.News@202205","url":"/安全通讯 Security.News/Security.News@202205/"}]},{"title":"最佳实践","type":"tag","url":"/tags/最佳实践/","items":[{"title":"Security.News@202205","url":"/安全通讯 Security.News/Security.News@202205/"}]},{"title":"机器学习","type":"tag","url":"/tags/机器学习/","items":[{"title":"WAF能力评估&测试","url":"/安全知识库/Blue Team基础设施/Web应用防火墙/通过机器学习改善 WAF/"}]},{"title":"流量检测","type":"tag","url":"/tags/流量检测/","items":[{"title":"基于统计学的C2流量检测","url":"/安全知识库/Blue Team能力建设/命令与控制 C2/基于统计学的C2流量检测/"}]},{"title":"知识管理","type":"tag","url":"/tags/知识管理/","items":[{"title":"阅读学习工作流","url":"/知识管理/阅读学习工作流/"}]},{"title":"系统设计","type":"tag","url":"/tags/系统设计/","items":[{"title":"系统设计基础知识","url":"/安全知识库/Blue Team基础设施/系统设计/系统设计基础知识/"}]},{"title":"终端基础设施","type":"tag","url":"/tags/终端基础设施/","items":[{"title":"2021 EPP魔力象限 EPP Magic Quadrant","url":"/安全知识库/Blue Team基础设施/终端基础设施/EDR/2021 EPP魔力象限 EPP Magic Quadrant/"},{"title":"保障IDC安全：分布式HIDS集群架构设计","url":"/安全知识库/Blue Team基础设施/终端基础设施/EDR/保障IDC安全：分布式HIDS集群架构设计/"},{"title":"MITRE EDR技术能力评估","url":"/安全知识库/Blue Team基础设施/终端基础设施/EDR能力评估/MITRE EDR技术能力评估/"},{"title":"Red Canary EDR买家指南","url":"/安全知识库/Blue Team基础设施/终端基础设施/EDR能力评估/Red Canary EDR买家指南/"},{"title":"CrowdStrike Falcon","url":"/安全知识库/Blue Team基础设施/终端基础设施/EDR商业化产品/CrowdStrike Falcon/"}]},{"title":"网络基础设施","type":"tag","url":"/tags/网络基础设施/","items":[{"title":"加密流量解决方案","url":"/安全知识库/Blue Team基础设施/网络基础设施/加密流量解决方案/"},{"title":"网络流量采集方案","url":"/安全知识库/Blue Team基础设施/网络基础设施/网络流量采集方案/"}]},{"title":"能力评估","type":"tag","url":"/tags/能力评估/","items":[{"title":"WAF能力评估&测试","url":"/安全知识库/Blue Team基础设施/Web应用防火墙/WAF能力评估&测试/"},{"title":"MITRE EDR技术能力评估","url":"/安全知识库/Blue Team基础设施/终端基础设施/EDR能力评估/MITRE EDR技术能力评估/"}]},{"title":"蜜罐","type":"tag","url":"/tags/蜜罐/","items":[{"title":"Security.News@202205","url":"/安全通讯 Security.News/Security.News@202205/"}]},{"title":"行业动态","type":"tag","url":"/tags/行业动态/","items":[{"title":"Security.News@202205","url":"/安全通讯 Security.News/Security.News@202205/"}]},{"title":"行业实践","type":"tag","url":"/tags/行业实践/","items":[{"title":"加密流量解决方案","url":"/安全知识库/Blue Team基础设施/网络基础设施/加密流量解决方案/"},{"title":"网络流量采集方案","url":"/安全知识库/Blue Team基础设施/网络基础设施/网络流量采集方案/"}]},{"title":"行业报告","type":"tag","url":"/tags/行业报告/","items":[{"title":"Security.News@202205","url":"/安全通讯 Security.News/Security.News@202205/"}]},{"title":"钓鱼","type":"tag","url":"/tags/钓鱼/","items":[{"title":"Security.News@202205","url":"/安全通讯 Security.News/Security.News@202205/"}]},{"title":"阿里云","type":"tag","url":"/tags/阿里云/","items":[{"title":"Security.News@202205","url":"/安全通讯 Security.News/Security.News@202205/"}]},{"title":"雾帜智能","type":"tag","url":"/tags/雾帜智能/","items":[{"title":"Security.News@202205","url":"/安全通讯 Security.News/Security.News@202205/"}]}],"latestPosts":[{"fields":{"slug":"/安全通讯 Security.News/Security.News@202205/","title":"Security.News@202205","lastUpdatedAt":"2023-04-09T07:41:56.000Z","lastUpdated":"4/9/2023"},"frontmatter":{"draft":false,"tags":["供应链安全","行业动态","安全事件","行业报告","学习资源","Google","阿里云","蜜罐","SOAR","雾帜智能","Twitter","NSA","最佳实践","数据泄露","钓鱼"]}},{"fields":{"slug":"/知识管理/阅读学习工作流/","title":"阅读学习工作流","lastUpdatedAt":"2023-04-09T07:40:50.000Z","lastUpdated":"4/9/2023"},"frontmatter":{"draft":false,"tags":["知识管理"]}},{"fields":{"slug":"/","title":"关于这个站点","lastUpdatedAt":"2023-04-09T03:44:47.000Z","lastUpdated":"4/9/2023"},"frontmatter":{"draft":false,"tags":[]}},{"fields":{"slug":"/安全知识库/Blue Team能力建设/命令与控制 C2/DNS Tunnel隧道检测/","title":"DNS Tunnel隧道检测","lastUpdatedAt":"2023-04-09T03:44:47.000Z","lastUpdated":"4/9/2023"},"frontmatter":{"draft":false,"tags":["Blue Team能力建设","命令与控制 C2","DNS"]}},{"fields":{"slug":"/安全知识库/Blue Team能力建设/命令与控制 C2/基于统计学的C2流量检测/","title":"基于统计学的C2流量检测","lastUpdatedAt":"2023-04-09T03:44:47.000Z","lastUpdated":"4/9/2023"},"frontmatter":{"draft":false,"tags":["Blue Team能力建设","命令与控制 C2","流量检测"]}},{"fields":{"slug":"/安全知识库/Blue Team能力建设/威胁检测规则/Elastic Rules/","title":"Elastic Rules","lastUpdatedAt":"2023-04-09T03:44:47.000Z","lastUpdated":"4/9/2023"},"frontmatter":{"draft":false,"tags":["Blue Team能力建设","威胁检测规则","Elastic"]}},{"fields":{"slug":"/安全知识库/Blue Team能力建设/威胁检测规则/SIGMA Rules/","title":"SIGMA Rules","lastUpdatedAt":"2023-04-09T03:44:47.000Z","lastUpdated":"4/9/2023"},"frontmatter":{"draft":false,"tags":["Blue Team能力建设","威胁检测规则","SIGMA"]}},{"fields":{"slug":"/安全知识库/Blue Team能力建设/威胁检测规则/Splunk Rules/","title":"Splunk Rules","lastUpdatedAt":"2023-04-09T03:44:47.000Z","lastUpdated":"4/9/2023"},"frontmatter":{"draft":false,"tags":["Blue Team能力建设","威胁检测规则","Splunk"]}},{"fields":{"slug":"/安全知识库/Blue Team基础设施/Web应用防火墙/WAF能力评估&测试/","title":"WAF能力评估&测试","lastUpdatedAt":"2023-04-09T03:34:07.000Z","lastUpdated":"4/9/2023"},"frontmatter":{"draft":false,"tags":["Blue Team基础设施","Web应用防火墙","能力评估"]}},{"fields":{"slug":"/安全知识库/Blue Team基础设施/Web应用防火墙/通过机器学习改善 WAF/","title":"WAF能力评估&测试","lastUpdatedAt":"2023-04-09T03:34:07.000Z","lastUpdated":"4/9/2023"},"frontmatter":{"draft":false,"tags":["Blue Team基础设施","Web应用防火墙","机器学习","Cloudflare"]}}]}},
    "staticQueryHashes": ["2230547434","2320115945","3495835395","451533639"]}